Revit 2024 API
DividedPath.Flipped Property
 If the divided path is flipped the nodes are numbered in the reverse order. It also switches the ends from which beginningIndent and endIndent are measured from.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool Flipped { get; }
Visual Basic
Public ReadOnly Property Flipped As Boolean
	Get
Visual C++
public:
property bool Flipped {
	bool get ();
}
See Also
DividedPath Class
Autodesk.Revit.DB Namespace